# Pandas

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

Import pandas and numpy with their aliases

In [19]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [20]:
a = pd.Series([ 100, 200, 300, 400])

Print a, and type(a)

In [21]:
print(a)
type(a)

0    100
1    200
2    300
3    400
dtype: int64

pandas.core.series.Series

Using indexing access the element 300 from the series a.

In [22]:
a[2]

300

What are the values of index for series a?

In [23]:
0,1,2,3

(0, 1, 2, 3)

Change the index to be ['c', 'a', 'b', 'd']

In [24]:
a=a.rename(index={0:'c',1:'a',2:'b',3:'d'})
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [25]:
a['d']

400

Sort the values wrt to the index

In [26]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

# Create a new Pandas Series having index as 'e', 'f', and 'g' and value 800,450,100

In [27]:
b = pd.Series([ 800, 450, 100],index=['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append this new Series object at the end of a

In [29]:
c = a.append(b)
c

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [30]:
c.sort_index()

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [42]:
s = c.sort_values()
s = s[::-1]
s

e    800
f    450
d    400
b    300
a    200
g    100
c    100
dtype: int64

In [44]:
s.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

### Part 1

Go through the documentation and mention the difference between pandas DataFrame and pandas Series.

Create a pandas dataframe from the series 'a' that we used in the last section, print the dataframe

In [57]:
df = pd.DataFrame(s)
df

     0
e  800
f  450
d  400
b  300
a  200
g  100
c  100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [58]:
df.shape

(7, 1)

What is the index of the dataframe, is it same as the series 'a'

In [60]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [61]:
df.head()

     0
e  800
f  450
d  400
b  300
a  200

In [62]:
df.tail()

     0
d  400
b  300
a  200
g  100
c  100

Rename the col of the dataframe as 'points'

In [77]:
df = df.rename(columns={0:'points'})
df

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

Create another Series which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [65]:
r = np.random.choice( ['orange','mango','apple'],7)
r

array(['orange', 'apple', 'mango', 'orange', 'mango', 'mango', 'mango'],
      dtype='<U6')

In [67]:
ss = pd.Series(r)
ss

0    orange
1     apple
2     mango
3    orange
4     mango
5     mango
6     mango
dtype: object

Change the index of fruits to the index of dataframe

In [70]:
ss = ss.rename(index={0:'e',1:'f',2:'d',3:'b',4:'a',5:'g',6:'c'})
ss

e    orange
f     apple
d     mango
b    orange
a     mango
g     mango
c     mango
dtype: object

Add this series as a new column to the dataframe with name of the col as 'fruits' <br> print the head of the dataframe to verify

In [78]:
df

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

In [81]:
type(df)

pandas.core.frame.DataFrame

In [89]:
ss = pd.DataFrame(ss)
ss = ss.rename(columns={0:'fruits'})

In [92]:
d = df.join(ss).head()
d

   points  fruits
e     800  orange
f     450   apple
d     400   mango
b     300  orange
a     200   mango

Optional questions: <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

### Part 2

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [93]:
d1 = pd.DataFrame(data={'city' : ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ],
                       'Temperature' : [15, 22, 20, 26,-2]})

Print(d1)

In [95]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [96]:
d1.shape

(5, 2)

Set city = d1['city']

In [97]:
city = d1['city']

print city <br>
What is the type of city.

In [98]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another datafeame where the cols are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [99]:
d2 = pd.DataFrame(data={'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
                      'Temperature' : [24,35,36,39] })
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [100]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [106]:
d3 = pd.concat([d1,d2])
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [107]:
d3[d3['Temperature']>=35]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## 3. Applying functions to columns and creating new columns

We need to create another column, which contains for each city a boolean value to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only two union territories.

In [142]:
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

In [147]:
d3['ut'] = d3['city'].str.contains['Chandigarh','Delhi','Pondicherry']
d3

TypeError: 'method' object is not subscriptable

In [148]:
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [149]:
d3['temp_farenhiet'] = (d3['Temperature']*1.8)+32
d3

          city  Temperature  temp_farenhiet
0   Chandigarh           15            59.0
1        Delhi           22            71.6
2       Kanpur           20            68.0
3      Chennai           26            78.8
4       Manali           -2            28.4
0    Bengalaru           24            75.2
1   Coimbatore           35            95.0
2    Srirangam           36            96.8
3  Pondicherry           39           102.2

## 4. Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [152]:
np.where(d3[d3['city']=='Chandigarh'])

(array([0, 0, 0]), array([0, 1, 2]))

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
3  Pondicherry           39   True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d1.

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [49]:
a=pd.date_range(start = '1/1/2020', end='1/4/2021')

In [50]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2020-12-26', '2020-12-27', '2020-12-28', '2020-12-29',
               '2020-12-30', '2020-12-31', '2021-01-01', '2021-01-02',
               '2021-01-03', '2021-01-04'],
              dtype='datetime64[ns]', length=370, freq='D')

print a

In [51]:
len(a)

370

What is the len of a?

In [52]:
len(a)

370

What is the type of a?

In [53]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

## input output

In [130]:
csv_read = pd.read_csv('/home/vimalkumar/Downloads/annual-enterprise-survey-2020-financial-year-provisional-csv.csv')
csv_read.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2020,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"733,258",ANZSIC06 divisions A-S (excluding classes K633...
1,2020,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"660,630",ANZSIC06 divisions A-S (excluding classes K633...
2,2020,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"54,342",ANZSIC06 divisions A-S (excluding classes K633...
3,2020,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"18,285",ANZSIC06 divisions A-S (excluding classes K633...
4,2020,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,872",ANZSIC06 divisions A-S (excluding classes K633...

In [131]:
csv_save = csv_read.to_csv('sample.csv')

In [ ]:
# read json file and save it in another json file

In [ ]:
# read csv file and save it in another csv file

In [ ]:
# read html file(web) and access tables from that and dhow the data

In [ ]:
# save above read table into another html file